# gettime
A command line utility to get time

## Get gettime
Download from [here](https://github.com/hillin/gettime/releases).

## Usage
```batch
:: current date and time
> gettime
:: current time
> gettime -mTime
:: current date
> gettime -mDate
:: time of one hour later
> gettime next-hour
:: time of 42 weeks later
> gettime next-42-weeks
:: time of 2 centuries ago
> gettime previous-2-centuries
:: custom format (https://msdn.microsoft.com/en-us/library/8kb3ddd4(v=vs.110).aspx)
> gettime -f yyMMdd-hhmmss-ddd-zzz
```
